Insurance/Insurance.API/Logs/log2023121316.txt

2023-12-13 16:24:36.449 +05:30 [INF] User profile is available. Using 'C:\Users\NanthagopalShanmugam\AppData\Local\ASP.NET\DataProtection-Keys' as key repository and Windows DPAPI to encrypt keys at rest.
2023-12-13 16:24:36.946 +05:30 [INF] Now listening on: https://localhost:7217
2023-12-13 16:24:36.947 +05:30 [INF] Now listening on: http://localhost:5217
2023-12-13 16:24:36.952 +05:30 [INF] Application started. Press Ctrl+C to shut down.
2023-12-13 16:24:36.953 +05:30 [INF] Hosting environment: Development
2023-12-13 16:24:36.954 +05:30 [INF] Content root path: C:\Hero_Insurance\HeroInsurance\Insurance\Insurance.API\
2023-12-13 16:24:37.224 +05:30 [INF] Request starting HTTP/2 GET https://localhost:7217/swagger/index.html - -
2023-12-13 16:24:37.717 +05:30 [INF] Request finished HTTP/2 GET https://localhost:7217/swagger/index.html - - - 200 - text/html;charset=utf-8 493.8044ms
2023-12-13 16:24:37.721 +05:30 [INF] Request starting HTTP/2 GET https://localhost:7217/_framework/aspnetcore-browser-refresh.js - -
2023-12-13 16:24:37.721 +05:30 [INF] Request starting HTTP/2 GET https://localhost:7217/_vs/browserLink - -
2023-12-13 16:24:37.735 +05:30 [INF] Request finished HTTP/2 GET https://localhost:7217/_framework/aspnetcore-browser-refresh.js - - - 200 13762 application/javascript;+charset=utf-8 13.9544ms
2023-12-13 16:24:37.790 +05:30 [INF] Request finished HTTP/2 GET https://localhost:7217/_vs/browserLink - - - 200 - text/javascript;+charset=UTF-8 69.6490ms
2023-12-13 16:24:37.837 +05:30 [INF] Request starting HTTP/2 GET https://localhost:7217/swagger/v1/swagger.json - -
2023-12-13 16:24:38.521 +05:30 [INF] Request finished HTTP/2 GET https://localhost:7217/swagger/v1/swagger.json - - - 200 - application/json;charset=utf-8 683.9889ms
2023-12-13 16:24:53.621 +05:30 [INF] Request starting HTTP/2 POST https://localhost:7217/api/v1/UnitedIndia/GetQuote application/json 1052
2023-12-13 16:24:53.649 +05:30 [INF] CORS policy execution successful.
2023-12-13 16:24:53.956 +05:30 [INF] Executing endpoint 'Insurance.API.Controllers.v1.UnitedIndiaController.GetQuote (Insurance.API)'
2023-12-13 16:24:54.008 +05:30 [INF] Route matched with {action = "GetQuote", controller = "UnitedIndia"}. Executing controller action with signature System.Threading.Tasks.Task`1[Microsoft.AspNetCore.Mvc.ActionResult`1[System.Collections.Generic.IEnumerable`1[Insurance.Domain.GoDigit.QuoteResponseModel]]] GetQuote(Insurance.Core.Features.UnitedIndia.Queries.GetQuote.GetUnitedIndiaQuoteQuery, System.Threading.CancellationToken) on controller Insurance.API.Controllers.v1.UnitedIndiaController (Insurance.API).
2023-12-13 16:25:39.789 +05:30 [INF] UnitedIndia Quote request <ROOT><HEADER><TXT_POSP_CODE>UIIP1804008785</TXT_POSP_CODE><TXT_POSP_NAME>Amit Dhama</TXT_POSP_NAME><CUR_BONUS_MALUS_PERCENT>0</CUR_BONUS_MALUS_PERCENT><DAT_DATE_OF_EXPIRY_OF_POLICY>20/12/2024</DAT_DATE_OF_EXPIRY_OF_POLICY><DAT_DATE_OF_ISSUE_OF_POLICY>21/12/2023</DAT_DATE_OF_ISSUE_OF_POLICY><DAT_DATE_OF_REGISTRATION>01/12/2017</DAT_DATE_OF_REGISTRATION><DAT_HOURS_EFFECTIVE_FROM>00:00:01</DAT_HOURS_EFFECTIVE_FROM><DAT_PREV_POLICY_EXPIRY_DATE>20/12/2023</DAT_PREV_POLICY_EXPIRY_DATE><NUM_IEV_ELEC_ACC_VALUE /><MEM_ADDRESS_OF_INSURED>XYZ</MEM_ADDRESS_OF_INSURED><NUM_IEV_NON_ELEC_ACC_VALUE /><NUM_BUSINESS_CODE>Roll Over</NUM_BUSINESS_CODE><NUM_CLIENT_TYPE>I</NUM_CLIENT_TYPE><NUM_CUBIC_CAPACITY>109</NUM_CUBIC_CAPACITY><NUM_IEV_BASE_VALUE>21232</NUM_IEV_BASE_VALUE><NUM_IEV_CNG_VALUE /><NUM_LL1 /><NUM_MONTH_OF_MANUFACTURE>12</NUM_MONTH_OF_MANUFACTURE><NUM_PA_UNNAMED_NUMBER /><NUM_PA_UNNAMED_AMOUNT /><NUM_PIN_CODE>411001</NUM_PIN_CODE><NUM_POLICY_NUMBER>TEST1234567890</NUM_POLICY_NUMBER><NUM_POLICY_TYPE>LiabilityOnly</NUM_POLICY_TYPE><NUM_RGSTRD_SEATING_CAPACITY>2</NUM_RGSTRD_SEATING_CAPACITY><NUM_TPPD_AMOUNT>6000</NUM_TPPD_AMOUNT><NUM_VOLUNTARY_EXCESS_AMOUNT /><NUM_YEAR_OF_MANUFACTURE>2017</NUM_YEAR_OF_MANUFACTURE><TXT_CHASSIS_NUMBER>MAN91338328487344378002</TXT_CHASSIS_NUMBER><TXT_DOB>10/04/1998</TXT_DOB><TXT_ELEC_DESC /><TXT_ENGINE_NUMBER>2FGJHJ459</TXT_ENGINE_NUMBER><TXT_FUEL>PETROL</TXT_FUEL><TXT_GEOG_AREA_EXTN_COUNTRY /><TXT_NAME_OF_INSURED>Nantha</TXT_NAME_OF_INSURED><TXT_NAME_OF_MANUFACTURER>HONDA</TXT_NAME_OF_MANUFACTURER><TXT_NAME_OF_NOMINEE>NomineeName</TXT_NAME_OF_NOMINEE><TXT_NON_ELEC_DESC /><TXT_OEM_DEALER_CODE>DEA002</TXT_OEM_DEALER_CODE><TXT_OEM_TRANSACTION_ID>UIIC20231213162515</TXT_OEM_TRANSACTION_ID><TXT_OTHER_MAKE>ACTIVA 4G</TXT_OTHER_MAKE><TXT_PREV_INSURER_CODE>BAGI</TXT_PREV_INSURER_CODE><TXT_REGISTRATION_NUMBER_1>MH</TXT_REGISTRATION_NUMBER_1><TXT_REGISTRATION_NUMBER_2>01</TXT_REGISTRATION_NUMBER_2><TXT_REGISTRATION_NUMBER_3>C</TXT_REGISTRATION_NUMBER_3><TXT_REGISTRATION_NUMBER_4>5632</TXT_REGISTRATION_NUMBER_4><TXT_RELATION_WITH_NOMINEE>Self</TXT_RELATION_WITH_NOMINEE><TXT_TYPE_BODY>SCOOTER</TXT_TYPE_BODY><TXT_VARIANT>STANDARD (BS IV)</TXT_VARIANT><YN_ANTI_THEFT>0</YN_ANTI_THEFT><YN_CLAIM>yes</YN_CLAIM><TXT_CPA_COVER_PERIOD>1</TXT_CPA_COVER_PERIOD><YN_VALID_DRIVING_LICENSE>Y</YN_VALID_DRIVING_LICENSE><YN_COMPULSORY_PA_DTLS>-1</YN_COMPULSORY_PA_DTLS><YN_PAID_DRIVER>N</YN_PAID_DRIVER><YN_INBUILT_CNG>0</YN_INBUILT_CNG><YN_INBUILT_LPG>0</YN_INBUILT_LPG><YN_NIL_DEPR_WITHOUT_EXCESS /><YN_ENGINE_GEAR_COVER /><NUM_VEHICLE_MODEL_CODE /><YN_RSA_COVER>N</YN_RSA_COVER><YN_NCB_PROTECT>False</YN_NCB_PROTECT></HEADER></ROOT>
2023-12-13 16:25:56.548 +05:30 [INF] UnitedIndia Quote request <?xml version="1.0" encoding="utf-16"?>
<soapenv:Envelope xmlns:ws="http://ws.uiic.com/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <ws:calculatePremium>
      <application>UIWBGENAGG</application>
      <userid>UIWBGENAGG</userid>
      <password>uiic1234</password>
      <proposalXml><![CDATA[<ROOT><HEADER><TXT_POSP_CODE>UIIP1804008785</TXT_POSP_CODE><TXT_POSP_NAME>Amit Dhama</TXT_POSP_NAME><CUR_BONUS_MALUS_PERCENT>0</CUR_BONUS_MALUS_PERCENT><DAT_DATE_OF_EXPIRY_OF_POLICY>20/12/2024</DAT_DATE_OF_EXPIRY_OF_POLICY><DAT_DATE_OF_ISSUE_OF_POLICY>21/12/2023</DAT_DATE_OF_ISSUE_OF_POLICY><DAT_DATE_OF_REGISTRATION>01/12/2017</DAT_DATE_OF_REGISTRATION><DAT_HOURS_EFFECTIVE_FROM>00:00:01</DAT_HOURS_EFFECTIVE_FROM><DAT_PREV_POLICY_EXPIRY_DATE>20/12/2023</DAT_PREV_POLICY_EXPIRY_DATE><NUM_IEV_ELEC_ACC_VALUE /><MEM_ADDRESS_OF_INSURED>XYZ</MEM_ADDRESS_OF_INSURED><NUM_IEV_NON_ELEC_ACC_VALUE /><NUM_BUSINESS_CODE>Roll Over</NUM_BUSINESS_CODE><NUM_CLIENT_TYPE>I</NUM_CLIENT_TYPE><NUM_CUBIC_CAPACITY>109</NUM_CUBIC_CAPACITY><NUM_IEV_BASE_VALUE>21232</NUM_IEV_BASE_VALUE><NUM_IEV_CNG_VALUE /><NUM_LL1 /><NUM_MONTH_OF_MANUFACTURE>12</NUM_MONTH_OF_MANUFACTURE><NUM_PA_UNNAMED_NUMBER /><NUM_PA_UNNAMED_AMOUNT /><NUM_PIN_CODE>411001</NUM_PIN_CODE><NUM_POLICY_NUMBER>TEST1234567890</NUM_POLICY_NUMBER><NUM_POLICY_TYPE>LiabilityOnly</NUM_POLICY_TYPE><NUM_RGSTRD_SEATING_CAPACITY>2</NUM_RGSTRD_SEATING_CAPACITY><NUM_TPPD_AMOUNT>6000</NUM_TPPD_AMOUNT><NUM_VOLUNTARY_EXCESS_AMOUNT /><NUM_YEAR_OF_MANUFACTURE>2017</NUM_YEAR_OF_MANUFACTURE><TXT_CHASSIS_NUMBER>MAN91338328487344378002</TXT_CHASSIS_NUMBER><TXT_DOB>10/04/1998</TXT_DOB><TXT_ELEC_DESC /><TXT_ENGINE_NUMBER>2FGJHJ459</TXT_ENGINE_NUMBER><TXT_FUEL>PETROL</TXT_FUEL><TXT_GEOG_AREA_EXTN_COUNTRY /><TXT_NAME_OF_INSURED>Nantha</TXT_NAME_OF_INSURED><TXT_NAME_OF_MANUFACTURER>HONDA</TXT_NAME_OF_MANUFACTURER><TXT_NAME_OF_NOMINEE>NomineeName</TXT_NAME_OF_NOMINEE><TXT_NON_ELEC_DESC /><TXT_OEM_DEALER_CODE>DEA002</TXT_OEM_DEALER_CODE><TXT_OEM_TRANSACTION_ID>UIIC20231213162515</TXT_OEM_TRANSACTION_ID><TXT_OTHER_MAKE>ACTIVA 4G</TXT_OTHER_MAKE><TXT_PREV_INSURER_CODE>BAGI</TXT_PREV_INSURER_CODE><TXT_REGISTRATION_NUMBER_1>MH</TXT_REGISTRATION_NUMBER_1><TXT_REGISTRATION_NUMBER_2>01</TXT_REGISTRATION_NUMBER_2><TXT_REGISTRATION_NUMBER_3>C</TXT_REGISTRATION_NUMBER_3><TXT_REGISTRATION_NUMBER_4>5632</TXT_REGISTRATION_NUMBER_4><TXT_RELATION_WITH_NOMINEE>Self</TXT_RELATION_WITH_NOMINEE><TXT_TYPE_BODY>SCOOTER</TXT_TYPE_BODY><TXT_VARIANT>STANDARD (BS IV)</TXT_VARIANT><YN_ANTI_THEFT>0</YN_ANTI_THEFT><YN_CLAIM>yes</YN_CLAIM><TXT_CPA_COVER_PERIOD>1</TXT_CPA_COVER_PERIOD><YN_VALID_DRIVING_LICENSE>Y</YN_VALID_DRIVING_LICENSE><YN_COMPULSORY_PA_DTLS>-1</YN_COMPULSORY_PA_DTLS><YN_PAID_DRIVER>N</YN_PAID_DRIVER><YN_INBUILT_CNG>0</YN_INBUILT_CNG><YN_INBUILT_LPG>0</YN_INBUILT_LPG><YN_NIL_DEPR_WITHOUT_EXCESS /><YN_ENGINE_GEAR_COVER /><NUM_VEHICLE_MODEL_CODE /><YN_RSA_COVER>N</YN_RSA_COVER><YN_NCB_PROTECT>False</YN_NCB_PROTECT></HEADER></ROOT>]]></proposalXml>
      <productCode>3112</productCode>
      <subproductCode>3</subproductCode>
    </ws:calculatePremium>
  </soapenv:Body>
</soapenv:Envelope>
2023-12-13 16:25:57.345 +05:30 [INF] Start processing HTTP request POST https://portal.uiic.in/UGenericServiceUAT/UGenericMotorOnlineService
2023-12-13 16:25:57.352 +05:30 [INF] Sending HTTP request POST https://portal.uiic.in/UGenericServiceUAT/UGenericMotorOnlineService
2023-12-13 16:26:54.122 +05:30 [INF] Received HTTP response headers after 56762.5841ms - 200
2023-12-13 16:26:54.130 +05:30 [INF] End processing HTTP request after 56792.2459ms - 200
2023-12-13 16:33:14.333 +05:30 [INF] User profile is available. Using 'C:\Users\NanthagopalShanmugam\AppData\Local\ASP.NET\DataProtection-Keys' as key repository and Windows DPAPI to encrypt keys at rest.
2023-12-13 16:33:14.664 +05:30 [INF] Now listening on: https://localhost:7217
2023-12-13 16:33:14.665 +05:30 [INF] Now listening on: http://localhost:5217
2023-12-13 16:33:14.669 +05:30 [INF] Application started. Press Ctrl+C to shut down.
2023-12-13 16:33:14.671 +05:30 [INF] Hosting environment: Development
2023-12-13 16:33:14.672 +05:30 [INF] Content root path: C:\Hero_Insurance\HeroInsurance\Insurance\Insurance.API\
2023-12-13 16:33:15.211 +05:30 [INF] Request starting HTTP/2 GET https://localhost:7217/swagger/index.html - -
2023-12-13 16:33:15.853 +05:30 [INF] Request finished HTTP/2 GET https://localhost:7217/swagger/index.html - - - 200 - text/html;charset=utf-8 645.7872ms
2023-12-13 16:33:15.855 +05:30 [INF] Request starting HTTP/2 GET https://localhost:7217/_vs/browserLink - -
2023-12-13 16:33:15.855 +05:30 [INF] Request starting HTTP/2 GET https://localhost:7217/_framework/aspnetcore-browser-refresh.js - -
2023-12-13 16:33:15.867 +05:30 [INF] Request finished HTTP/2 GET https://localhost:7217/_framework/aspnetcore-browser-refresh.js - - - 200 13762 application/javascript;+charset=utf-8 11.9125ms
2023-12-13 16:33:15.924 +05:30 [INF] Request finished HTTP/2 GET https://localhost:7217/_vs/browserLink - - - 200 - text/javascript;+charset=UTF-8 69.3878ms
2023-12-13 16:33:15.971 +05:30 [INF] Request starting HTTP/2 GET https://localhost:7217/swagger/v1/swagger.json - -
2023-12-13 16:33:16.665 +05:30 [INF] Request finished HTTP/2 GET https://localhost:7217/swagger/v1/swagger.json - - - 200 - application/json;charset=utf-8 694.0443ms
2023-12-13 16:34:30.058 +05:30 [INF] Request starting HTTP/2 POST https://localhost:7217/api/v1/UnitedIndia/GetQuote application/json 1052
2023-12-13 16:34:30.100 +05:30 [INF] CORS policy execution successful.
2023-12-13 16:34:31.092 +05:30 [INF] Executing endpoint 'Insurance.API.Controllers.v1.UnitedIndiaController.GetQuote (Insurance.API)'
2023-12-13 16:34:31.139 +05:30 [INF] Route matched with {action = "GetQuote", controller = "UnitedIndia"}. Executing controller action with signature System.Threading.Tasks.Task`1[Microsoft.AspNetCore.Mvc.ActionResult`1[System.Collections.Generic.IEnumerable`1[Insurance.Domain.GoDigit.QuoteResponseModel]]] GetQuote(Insurance.Core.Features.UnitedIndia.Queries.GetQuote.GetUnitedIndiaQuoteQuery, System.Threading.CancellationToken) on controller Insurance.API.Controllers.v1.UnitedIndiaController (Insurance.API).
2023-12-13 16:34:39.417 +05:30 [INF] UnitedIndia Quote request <ROOT><HEADER><TXT_POSP_CODE>UIIP1804008785</TXT_POSP_CODE><TXT_POSP_NAME>Amit Dhama</TXT_POSP_NAME><CUR_BONUS_MALUS_PERCENT>0</CUR_BONUS_MALUS_PERCENT><DAT_DATE_OF_EXPIRY_OF_POLICY>20/12/2024</DAT_DATE_OF_EXPIRY_OF_POLICY><DAT_DATE_OF_ISSUE_OF_POLICY>21/12/2023</DAT_DATE_OF_ISSUE_OF_POLICY><DAT_DATE_OF_REGISTRATION>01/12/2017</DAT_DATE_OF_REGISTRATION><DAT_HOURS_EFFECTIVE_FROM>00:00:01</DAT_HOURS_EFFECTIVE_FROM><DAT_PREV_POLICY_EXPIRY_DATE>20/12/2023</DAT_PREV_POLICY_EXPIRY_DATE><NUM_IEV_ELEC_ACC_VALUE /><MEM_ADDRESS_OF_INSURED>XYZ</MEM_ADDRESS_OF_INSURED><NUM_IEV_NON_ELEC_ACC_VALUE /><NUM_BUSINESS_CODE>Roll Over</NUM_BUSINESS_CODE><NUM_CLIENT_TYPE>I</NUM_CLIENT_TYPE><NUM_CUBIC_CAPACITY>109</NUM_CUBIC_CAPACITY><NUM_IEV_BASE_VALUE>21232</NUM_IEV_BASE_VALUE><NUM_IEV_CNG_VALUE /><NUM_LL1 /><NUM_MONTH_OF_MANUFACTURE>12</NUM_MONTH_OF_MANUFACTURE><NUM_PA_UNNAMED_NUMBER>2</NUM_PA_UNNAMED_NUMBER><NUM_PA_UNNAMED_AMOUNT /><NUM_PIN_CODE>411001</NUM_PIN_CODE><NUM_POLICY_NUMBER>TEST1234567890</NUM_POLICY_NUMBER><NUM_POLICY_TYPE>LiabilityOnly</NUM_POLICY_TYPE><NUM_RGSTRD_SEATING_CAPACITY>2</NUM_RGSTRD_SEATING_CAPACITY><NUM_TPPD_AMOUNT>6000</NUM_TPPD_AMOUNT><NUM_VOLUNTARY_EXCESS_AMOUNT /><NUM_YEAR_OF_MANUFACTURE>2017</NUM_YEAR_OF_MANUFACTURE><TXT_CHASSIS_NUMBER>MAN91338328487344378002</TXT_CHASSIS_NUMBER><TXT_DOB>10/04/1998</TXT_DOB><TXT_ELEC_DESC /><TXT_ENGINE_NUMBER>2FGJHJ459</TXT_ENGINE_NUMBER><TXT_FUEL>PETROL</TXT_FUEL><TXT_GEOG_AREA_EXTN_COUNTRY /><TXT_NAME_OF_INSURED>Nantha</TXT_NAME_OF_INSURED><TXT_NAME_OF_MANUFACTURER>HONDA</TXT_NAME_OF_MANUFACTURER><TXT_NAME_OF_NOMINEE>NomineeName</TXT_NAME_OF_NOMINEE><TXT_NON_ELEC_DESC /><TXT_OEM_DEALER_CODE>DEA002</TXT_OEM_DEALER_CODE><TXT_OEM_TRANSACTION_ID>UIIC20231213163439</TXT_OEM_TRANSACTION_ID><TXT_OTHER_MAKE>ACTIVA 4G</TXT_OTHER_MAKE><TXT_PREV_INSURER_CODE>BAGI</TXT_PREV_INSURER_CODE><TXT_REGISTRATION_NUMBER_1>MH</TXT_REGISTRATION_NUMBER_1><TXT_REGISTRATION_NUMBER_2>01</TXT_REGISTRATION_NUMBER_2><TXT_REGISTRATION_NUMBER_3>C</TXT_REGISTRATION_NUMBER_3><TXT_REGISTRATION_NUMBER_4>5632</TXT_REGISTRATION_NUMBER_4><TXT_RELATION_WITH_NOMINEE>Self</TXT_RELATION_WITH_NOMINEE><TXT_TYPE_BODY>SCOOTER</TXT_TYPE_BODY><TXT_VARIANT>STANDARD (BS IV)</TXT_VARIANT><YN_ANTI_THEFT>0</YN_ANTI_THEFT><YN_CLAIM>yes</YN_CLAIM><TXT_CPA_COVER_PERIOD>1</TXT_CPA_COVER_PERIOD><YN_VALID_DRIVING_LICENSE>Y</YN_VALID_DRIVING_LICENSE><YN_COMPULSORY_PA_DTLS>-1</YN_COMPULSORY_PA_DTLS><YN_PAID_DRIVER>N</YN_PAID_DRIVER><YN_INBUILT_CNG>0</YN_INBUILT_CNG><YN_INBUILT_LPG>0</YN_INBUILT_LPG><YN_NIL_DEPR_WITHOUT_EXCESS /><YN_ENGINE_GEAR_COVER /><NUM_VEHICLE_MODEL_CODE /><YN_RSA_COVER>N</YN_RSA_COVER><YN_NCB_PROTECT>False</YN_NCB_PROTECT></HEADER></ROOT>
2023-12-13 16:34:39.454 +05:30 [INF] UnitedIndia Quote request <?xml version="1.0" encoding="utf-16"?>
<soapenv:Envelope xmlns:ws="http://ws.uiic.com/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <ws:calculatePremium>
      <application>UIWBGENAGG</application>
      <userid>UIWBGENAGG</userid>
      <password>uiic1234</password>
      <proposalXml><![CDATA[<ROOT><HEADER><TXT_POSP_CODE>UIIP1804008785</TXT_POSP_CODE><TXT_POSP_NAME>Amit Dhama</TXT_POSP_NAME><CUR_BONUS_MALUS_PERCENT>0</CUR_BONUS_MALUS_PERCENT><DAT_DATE_OF_EXPIRY_OF_POLICY>20/12/2024</DAT_DATE_OF_EXPIRY_OF_POLICY><DAT_DATE_OF_ISSUE_OF_POLICY>21/12/2023</DAT_DATE_OF_ISSUE_OF_POLICY><DAT_DATE_OF_REGISTRATION>01/12/2017</DAT_DATE_OF_REGISTRATION><DAT_HOURS_EFFECTIVE_FROM>00:00:01</DAT_HOURS_EFFECTIVE_FROM><DAT_PREV_POLICY_EXPIRY_DATE>20/12/2023</DAT_PREV_POLICY_EXPIRY_DATE><NUM_IEV_ELEC_ACC_VALUE /><MEM_ADDRESS_OF_INSURED>XYZ</MEM_ADDRESS_OF_INSURED><NUM_IEV_NON_ELEC_ACC_VALUE /><NUM_BUSINESS_CODE>Roll Over</NUM_BUSINESS_CODE><NUM_CLIENT_TYPE>I</NUM_CLIENT_TYPE><NUM_CUBIC_CAPACITY>109</NUM_CUBIC_CAPACITY><NUM_IEV_BASE_VALUE>21232</NUM_IEV_BASE_VALUE><NUM_IEV_CNG_VALUE /><NUM_LL1 /><NUM_MONTH_OF_MANUFACTURE>12</NUM_MONTH_OF_MANUFACTURE><NUM_PA_UNNAMED_NUMBER>2</NUM_PA_UNNAMED_NUMBER><NUM_PA_UNNAMED_AMOUNT /><NUM_PIN_CODE>411001</NUM_PIN_CODE><NUM_POLICY_NUMBER>TEST1234567890</NUM_POLICY_NUMBER><NUM_POLICY_TYPE>LiabilityOnly</NUM_POLICY_TYPE><NUM_RGSTRD_SEATING_CAPACITY>2</NUM_RGSTRD_SEATING_CAPACITY><NUM_TPPD_AMOUNT>6000</NUM_TPPD_AMOUNT><NUM_VOLUNTARY_EXCESS_AMOUNT /><NUM_YEAR_OF_MANUFACTURE>2017</NUM_YEAR_OF_MANUFACTURE><TXT_CHASSIS_NUMBER>MAN91338328487344378002</TXT_CHASSIS_NUMBER><TXT_DOB>10/04/1998</TXT_DOB><TXT_ELEC_DESC /><TXT_ENGINE_NUMBER>2FGJHJ459</TXT_ENGINE_NUMBER><TXT_FUEL>PETROL</TXT_FUEL><TXT_GEOG_AREA_EXTN_COUNTRY /><TXT_NAME_OF_INSURED>Nantha</TXT_NAME_OF_INSURED><TXT_NAME_OF_MANUFACTURER>HONDA</TXT_NAME_OF_MANUFACTURER><TXT_NAME_OF_NOMINEE>NomineeName</TXT_NAME_OF_NOMINEE><TXT_NON_ELEC_DESC /><TXT_OEM_DEALER_CODE>DEA002</TXT_OEM_DEALER_CODE><TXT_OEM_TRANSACTION_ID>UIIC20231213163439</TXT_OEM_TRANSACTION_ID><TXT_OTHER_MAKE>ACTIVA 4G</TXT_OTHER_MAKE><TXT_PREV_INSURER_CODE>BAGI</TXT_PREV_INSURER_CODE><TXT_REGISTRATION_NUMBER_1>MH</TXT_REGISTRATION_NUMBER_1><TXT_REGISTRATION_NUMBER_2>01</TXT_REGISTRATION_NUMBER_2><TXT_REGISTRATION_NUMBER_3>C</TXT_REGISTRATION_NUMBER_3><TXT_REGISTRATION_NUMBER_4>5632</TXT_REGISTRATION_NUMBER_4><TXT_RELATION_WITH_NOMINEE>Self</TXT_RELATION_WITH_NOMINEE><TXT_TYPE_BODY>SCOOTER</TXT_TYPE_BODY><TXT_VARIANT>STANDARD (BS IV)</TXT_VARIANT><YN_ANTI_THEFT>0</YN_ANTI_THEFT><YN_CLAIM>yes</YN_CLAIM><TXT_CPA_COVER_PERIOD>1</TXT_CPA_COVER_PERIOD><YN_VALID_DRIVING_LICENSE>Y</YN_VALID_DRIVING_LICENSE><YN_COMPULSORY_PA_DTLS>-1</YN_COMPULSORY_PA_DTLS><YN_PAID_DRIVER>N</YN_PAID_DRIVER><YN_INBUILT_CNG>0</YN_INBUILT_CNG><YN_INBUILT_LPG>0</YN_INBUILT_LPG><YN_NIL_DEPR_WITHOUT_EXCESS /><YN_ENGINE_GEAR_COVER /><NUM_VEHICLE_MODEL_CODE /><YN_RSA_COVER>N</YN_RSA_COVER><YN_NCB_PROTECT>False</YN_NCB_PROTECT></HEADER></ROOT>]]></proposalXml>
      <productCode>3112</productCode>
      <subproductCode>3</subproductCode>
    </ws:calculatePremium>
  </soapenv:Body>
</soapenv:Envelope>
2023-12-13 16:34:40.122 +05:30 [INF] Start processing HTTP request POST https://portal.uiic.in/UGenericServiceUAT/UGenericMotorOnlineService
2023-12-13 16:34:40.130 +05:30 [INF] Sending HTTP request POST https://portal.uiic.in/UGenericServiceUAT/UGenericMotorOnlineService
2023-12-13 16:35:25.205 +05:30 [INF] Received HTTP response headers after 45051.9597ms - 200
2023-12-13 16:35:25.230 +05:30 [INF] End processing HTTP request after 45115.6098ms - 200
2023-12-13 16:35:38.697 +05:30 [INF] Executing OkObjectResult, writing value of type 'ThirdPartyUtilities.Models.ResultModel'.
2023-12-13 16:35:38.807 +05:30 [INF] Executed action Insurance.API.Controllers.v1.UnitedIndiaController.GetQuote (Insurance.API) in 67653.4026ms
2023-12-13 16:35:38.810 +05:30 [INF] Executed endpoint 'Insurance.API.Controllers.v1.UnitedIndiaController.GetQuote (Insurance.API)'
2023-12-13 16:35:38.820 +05:30 [INF] Request finished HTTP/2 POST https://localhost:7217/api/v1/UnitedIndia/GetQuote application/json 1052 - 200 - application/json;+charset=utf-8 68762.2986ms
